; domain
(define (domain shattered-kingdom)
  (:requirements :strips :typing :equality)
  (:types
    hero sorcerer - character
    faction
    location
    fragment
  )

  (:predicates
    (at ?h - hero ?l - location)
    (sorcerer-at ?s - sorcerer ?l - location)
    (faction-at ?f - faction ?l - location)
    (has-fragment ?h - hero ?frag - fragment)
    (faction-holds-fragment ?f - faction ?frag - fragment)
    (connected ?from - location ?to - location)
    (path-is-stormy ?from - location ?to - location)
    (path-has-bandits ?from - location ?to - location)
    (faction-is-distrustful ?f - faction)
    (malakar-is-active)
    (malakar-is-defeated)
    (crystal-is-restored)
    (information-is-gathered)
    (allies-are-recruited)
    (scouted-location ?l - location)
    (is-village ?l - location)
  )

  (:action gather-information
    :parameters (?h - hero ?l - location)
    :precondition (and
      (at ?h ?l)
      (is-village ?l)
      (not (information-is-gathered))
    )
    :effect (and
      (information-is-gathered)
    )
  )

  (:action recruit-allies
    :parameters (?h - hero ?l - location)
    :precondition (and
      (at ?h ?l)
      (is-village ?l)
      (not (allies-are-recruited))
    )
    :effect (and
      (allies-are-recruited)
    )
  )

  (:action travel
    :parameters (?h - hero ?from - location ?to - location)
    :precondition (and
      (at ?h ?from)
      (connected ?from ?to)
      (information-is-gathered)
      (not (path-is-stormy ?from ?to))
      (not (path-has-bandits ?from ?to))
    )
    :effect (and
      (not (at ?h ?from))
      (at ?h ?to)
    )
  )

  (:action calm-stormy-path
    :parameters (?h - hero ?from - location ?to - location)
    :precondition (and
      (at ?h ?from)
      (path-is-stormy ?from ?to)
    )
    :effect (and
      (not (path-is-stormy ?from ?to))
    )
  )

  (:action defeat-bandits-on-path
    :parameters (?h - hero ?from - location ?to - location)
    :precondition (and
      (at ?h ?from)
      (path-has-bandits ?from ?to)
    )
    :effect (and
      (not (path-has-bandits ?from ?to))
    )
  )

  (:action complete-faction-trial
    :parameters (?h - hero ?f - faction ?frag - fragment ?l - location)
    :precondition (and
      (at ?h ?l)
      (faction-at ?f ?l)
      (faction-is-distrustful ?f)
      (faction-holds-fragment ?f ?frag)
    )
    :effect (and
      (not (faction-is-distrustful ?f))
      (not (faction-holds-fragment ?f ?frag))
      (has-fragment ?h ?frag)
    )
  )

  (:action scout-for-hidden-paths
    :parameters (?h - hero ?l - location)
    :precondition (and
      (at ?h ?l)
      (not (scouted-location ?l))
    )
    :effect (and
      (scouted-location ?l)
    )
  )

  (:action confront-malakar-and-restore-crystal
    :parameters (?h - hero ?s - sorcerer ?l - location ?f1 - fragment ?f2 - fragment ?f3 - fragment)
    :precondition (and
      (at ?h ?l)
      (sorcerer-at ?s ?l)
      (malakar-is-active)
      (has-fragment ?h ?f1)
      (has-fragment ?h ?f2)
      (has-fragment ?h ?f3)
      (not (= ?f1 ?f2))
      (not (= ?f1 ?f3))
      (not (= ?f2 ?f3))
    )
    :effect (and
      (not (malakar-is-active))
      (malakar-is-defeated)
      (crystal-is-restored)
    )
  )
)

; problem
(define (problem shattered-kingdom-quest)
  (:domain shattered-kingdom)
  (:objects
    elara - hero
    malakar - sorcerer
    elves dwarves - faction
    windhaven forestofwhispers cursedmarsh dwarvenstronghold fortressofshadows - location
    crystalfragment elvenfragment dwarvenfragment - fragment
  )

  (:init
    (at elara windhaven)
    (is-village windhaven)
    (has-fragment elara crystalfragment)
    (sorcerer-at malakar fortressofshadows)
    (malakar-is-active)

    (faction-at elves forestofwhispers)
    (faction-at dwarves dwarvenstronghold)

    (faction-holds-fragment elves elvenfragment)
    (faction-holds-fragment dwarves dwarvenfragment)

    (faction-is-distrustful elves)
    (faction-is-distrustful dwarves)

    (connected windhaven forestofwhispers)
    (connected forestofwhispers windhaven)
    (connected forestofwhispers cursedmarsh)
    (connected cursedmarsh forestofwhispers)
    (connected cursedmarsh dwarvenstronghold)
    (connected dwarvenstronghold cursedmarsh)
    (connected dwarvenstronghold fortressofshadows)
    (connected fortressofshadows dwarvenstronghold)

    (path-is-stormy windhaven forestofwhispers)
    (path-has-bandits cursedmarsh dwarvenstronghold)
  )

  (:goal (and
    (malakar-is-defeated)
    (crystal-is-restored)
  ))
)

; plan
1. (gather-information elara windhaven)
   added: (information-is-gathered)
   goals met: 0 of 2
2. (calm-stormy-path elara windhaven forestofwhispers)
   deleted: (path-is-stormy windhaven forestofwhispers)
   goals met: 0 of 2
3. (travel elara windhaven forestofwhispers)
   deleted: (at elara windhaven)
   added: (at elara forestofwhispers)
   goals met: 0 of 2
4. (complete-faction-trial elara elves elvenfragment forestofwhispers)
   deleted: (faction-is-distrustful elves) (faction-holds-fragment elves elvenfragment)
   added: (has-fragment elara elvenfragment)
   goals met: 0 of 2
5. (travel elara forestofwhispers cursedmarsh)
   deleted: (at elara forestofwhispers)
   added: (at elara cursedmarsh)
   goals met: 0 of 2
6. (defeat-bandits-on-path elara cursedmarsh dwarvenstronghold)
   deleted: (path-has-bandits cursedmarsh dwarvenstronghold)
   goals met: 0 of 2
7. (travel elara cursedmarsh dwarvenstronghold)
   deleted: (at elara cursedmarsh)
   added: (at elara dwarvenstronghold)
   goals met: 0 of 2
8. (complete-faction-trial elara dwarves dwarvenfragment dwarvenstronghold)
   deleted: (faction-is-distrustful dwarves) (faction-holds-fragment dwarves dwarvenfragment)
   added: (has-fragment elara dwarvenfragment)
   goals met: 0 of 2
9. (travel elara dwarvenstronghold fortressofshadows)
   deleted: (at elara dwarvenstronghold)
   added: (at elara fortressofshadows)
   goals met: 0 of 2
10. (confront-malakar-and-restore-crystal elara malakar fortressofshadows crystalfragment dwarvenfragment elvenfragment)
   deleted: (malakar-is-active)
   added: (malakar-is-defeated) (crystal-is-restored)
   goals met: 2 of 2
